//Написать программу вычисления значения функции y = f(a)
// y = 2a+1
int a = new Random().Next(1,11);
Console.WriteLine(a);
Console.WriteLine("y = 2a+1 = {0}", 2*a + 1);