// Дано число из отрезка [10, 99]. Показать наибольшую цифру числа
int N = new Random().Next(10,99);
Console.WriteLine(N);
